In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('titanic.csv', usecols= ['survived', 'pclass', 'sex', 'age', 'fare'])

In [3]:
titanic.head(10)

   survived  pclass     sex   age     fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500
5         0       3    male   NaN   8.4583
6         0       1    male  54.0  51.8625
7         0       3    male   2.0  21.0750
8         1       3  female  27.0  11.1333
9         1       2  female  14.0  30.0708

In [4]:
summary = titanic.groupby(['sex', 'pclass']).mean()

In [5]:
summary

               survived        age        fare
sex    pclass
female 1       0.968085  34.611765  106.125798
       2       0.921053  28.722973   21.970121
       3       0.500000  21.750000   16.118810
male   1       0.368852  41.281386   67.226127
       2       0.157407  30.740707   19.741782
       3       0.135447  26.507589   12.661633

As we've done before, we calculate the survival rate, average age and average pair, grouping by gender and passenger class.  We get a multi-indexed dataframe back.

In [6]:
summary.index

MultiIndex([('female', 1),
            ('female', 2),
            ('female', 3),
            (  'male', 1),
            (  'male', 2),
            (  'male', 3)],
           names=['sex', 'pclass'])

We can access specific parts of the multi-indexed result by using the `.loc()` method.

In [7]:
summary.loc[('female', 2), :]

survived     0.921053
age         28.722973
fare        21.970121
Name: (female, 2), dtype: float64

In [8]:
summary.loc[('female', 2), 'age']

28.722972972972972

If we want to change the order of our index levels, we can do that with the `.swaplevel()` method.

In [9]:
summary.swaplevel()#.sort_index()

               survived        age        fare
pclass sex
1      female  0.968085  34.611765  106.125798
2      female  0.921053  28.722973   21.970121
3      female  0.500000  21.750000   16.118810
1      male    0.368852  41.281386   67.226127
2      male    0.157407  30.740707   19.741782
3      male    0.135447  26.507589   12.661633

If we want to get rid of the multi-index altogether, we can use `.reset_index()`

In [10]:
summary.reset_index()

      sex  pclass  survived        age        fare
0  female       1  0.968085  34.611765  106.125798
1  female       2  0.921053  28.722973   21.970121
2  female       3  0.500000  21.750000   16.118810
3    male       1  0.368852  41.281386   67.226127
4    male       2  0.157407  30.740707   19.741782
5    male       3  0.135447  26.507589   12.661633